In [ ]:
from sklearn import datasets
from sklearn.linear_model import LogisticRegression
import pandas as pd
import numpy as np

In [ ]:
train = pd.read_csv('train.csv', delimiter = ',')
test = pd.read_csv('test.csv', delimiter = ',')

In [ ]:
train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    668 non-null    int64
 1   Name      668 non-null    object
 2   Sex       668 non-null    object
 3   Age       536 non-null    float64
 4   SibSp     668 non-null    int64
 5   Parch     668 non-null    int64
 6   Ticket    668 non-null    object
 7   Fare      668 non-null    float64
 8   Cabin     154 non-null    object
 9   Embarked  667 non-null    object
 10  Survived  668 non-null    int64
dtypes: float64(2), int64(4), object(5)
memory usage: 57.5+ KB

In [ ]:
train.describe()

           Pclass         Age       SibSp       Parch        Fare    Survived
count  668.000000  536.000000  668.000000  668.000000  668.000000  668.000000
mean     2.296407   29.700560    0.528443    0.407186   32.064552    0.402695
std      0.831638   14.240257    1.080327    0.854695   45.320835    0.490808
min      1.000000    0.670000    0.000000    0.000000    0.000000    0.000000
25%      2.000000   21.000000    0.000000    0.000000    7.925000    0.000000
50%      3.000000   29.000000    0.000000    0.000000   14.750000    0.000000
75%      3.000000   38.250000    1.000000    0.000000   31.275000    1.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200    1.000000

In [ ]:
mean_age = train[['Pclass','Age']].groupby('Pclass').mean()

In [ ]:
def clean_age(data2clean):
    
    pclass = data2clean[0];age = data2clean[1]
    if pd.isnull(age):
        if pclass == 1:
            return mean_age.loc[1]['Age']
        elif pclass == 2:
            return mean_age.loc[2]['Age']
        else:
            return mean_age.loc[3]['Age']
    else:
        return age

In [ ]:
train['Age'] = train[['Pclass','Age']].apply(clean_age,axis = 1)

In [ ]:
mean_age = test[['Pclass','Age']].groupby('Pclass').mean()
test['Age'] = test[['Pclass','Age']].apply(clean_age,axis = 1)

In [ ]:
train.drop('Cabin',axis=1,inplace= True)
test.drop('Cabin',axis=1,inplace= True)

In [ ]:
train.dropna(inplace=True)

In [ ]:
mean_fare = test[['Fare','Pclass']].groupby('Pclass').mean()

In [ ]:
def clean_fares(col):
    fare = col[0]
    pclass = col[1]
    if pd.isnull(fare):
        if pclass == 1:
            return mean_fare.loc[1]['Fare']
        elif pclass == 2:
            return mean_fare.loc[2]['Fare']
        else:
            return mean_fare.loc[3]['Fare']
    else:
        return fare

In [ ]:
test['Fare'] = test[['Fare','Pclass']].apply(clean_fares,axis = 1)

In [ ]:
sex_train = pd.get_dummies(train['Sex'],drop_first=True)
sex_test = pd.get_dummies(test['Sex'],drop_first=True)

In [ ]:
embark_train = pd.get_dummies(train['Embarked'],drop_first=True)
embark_test = pd.get_dummies(test['Embarked'],drop_first=True)

In [ ]:
train.head()

   Pclass                                            Name  ... Embarked  Survived
0       2   Weisz, Mrs. Leopold (Mathilde Francoise Pede)  ...        S         1
1       3               Williams, Mr. Howard Hugh "Harry"  ...        S         0
2       2  Morley, Mr. Henry Samuel ("Mr Henry Marshall")  ...        S         0
3       3     Palsson, Mrs. Nils (Alma Cornelia Berglund)  ...        S         0
4       3                          Sutehall, Mr. Henry Jr  ...        S         0

[5 rows x 10 columns]

In [ ]:
train.drop(['Name','Sex','Ticket','Embarked'],axis=1,inplace= True)
test.drop(['Name','Sex','Ticket','Embarked'],axis=1,inplace= True)

In [ ]:
train = pd.concat([train,sex_train,embark_train],axis=1)
train.head()

   Pclass        Age  SibSp  Parch    Fare  Survived  male  Q  S
0       2  29.000000      1      0  26.000         1     0  0  1
1       3  25.839423      0      0   8.050         0     1  0  1
2       2  39.000000      0      0  26.000         0     1  0  1
3       3  29.000000      0      4  21.075         0     0  0  1
4       3  25.000000      0      0   7.050         0     1  0  1

In [ ]:
test = pd.concat([test,sex_test,embark_test],axis=1)
test.head()

   Pclass        Age  SibSp  Parch     Fare  male  Q  S
0       2   8.000000      1      1  36.7500     1  0  1
1       1  49.000000      0      0  25.9292     0  0  1
2       3  23.228105      0      0   7.7375     1  1  0
3       2  24.000000      2      1  27.0000     0  0  1
4       1  36.000000      0      0  26.2875     1  0  1

In [ ]:
x_train = train.drop('Survived',axis = 1)
y_train = train['Survived']
x_test = test

In [ ]:
from sklearn.linear_model import LogisticRegression

In [ ]:
logmodel = LogisticRegression()

In [ ]:
logmodel.fit(x_train,y_train)

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
logmodel.score(x_train,y_train)

0.7946026986506747

In [ ]:
y_test = logmodel.predict(x_test)

In [ ]:
y_test

array([0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 0, 0])

In [ ]:
np.savetxt('titanic_1.csv', y_test  ,fmt = "%0f",delimiter=',')